keywords_list = [
    '기숙사',
    '등록금',
    '수강신청',
    '공모전',
    '장학금',
    '복학',
    '성적',
    '휴학',
    '졸업',
    '봉사',
    '해외',
    '인턴',
    '계절',
]

mapper = {
    # 학부대학
    '사회과학계열': '0101',
    '인문사회계열': '0102',
    '공학계열': '0103',
    '자연과학계열': '0104',

    # 유학대학
    '유학동양학과': '0201',

    # 문과대학
    '국어국문학과': '0301',
    '독어독문학과': '0302',
    '러시아어문학과': '0303',
    '문헌정보학과': '0304',
    '사학과': '0305',
    '영어영문학과': '0306',
    '중어중문학과': '0307',
    '철학과': '0308',
    '프랑스어문학과': '0309',
    '한문학과': '0310',

    # 사회과학대학
    '글로벌리더학부': '0401',
    '미디어커뮤니케이션학과': '0402',
    '사회복지학과': '0403',
    '사회학과': '0404',
    '소비자학과': '0405',
    '심리학과': '0406',
    '아동·청소년학과': '0407',
    '정치외교학과': '0408',
    '행정학과': '0409',

    # 경제대학
    '경제학과': '0501',
    '글로벌경제학과': '0502',
    '통계학과': '0503',

    # 경영대학
    '경영학과': '0601',
    '글로벌경영학과': '0602',

    # 사범대학
    '교육학과': '0701',
    '수학교육과': '0702',
    '컴퓨터교육과': '0703',
    '한문교육과': '0704',

    # 예술대학
    '디자인학과': '0801',
    '무용학과': '0802',
    '미술학과': '0803',
    '연기예술학과': '0804',
    '의상학과': '0805',
    '영상학과': '0806',

    # 자연과학대학
    '물리학과': '0901',
    '생명과학과': '0902',
    '수학과': '0903',
    '화학과': '0904',

    # 정보통신대학
    '반도체시스템공학과': '1001',
    '반도체융합공학과': '1002',
    '소재부품융합공학과': '1003',
    '전자전기공학부': '1004',
    '차세대반도체공학연계전공': '1005',

    # 소프트웨어융합대학
    '글로벌융합학부 공통': '1101',
    '데이터사이언스융합전공': '1102',
    '소프트웨어학과': '1103',
    '인공지능융합전공': '1104',
    '자기설계융합전공': '1105',
    '지능형소프트웨어학과': '1106',
    '컬쳐앤테크놀로지융합전공': '1107',

    # 공과대학
    '건설환경공학부': '1201',
    '건축학과(건축학계열)': '1202',
    '기계공학부': '1203',
    '나노공학과': '1204',
    '신소재공학부': '1205',
    '시스템경영공학과': '1206',
    '화학공학/고분자공학부': '1207',

    # 약학대학
    '약학과': '1301',

    # 생명공학대학
    '바이오메카트로닉스학과': '1401',
    '식품생명공학과': '1402',
    '융합생명공학과': '1403',

    # 스포츠과학대학
    '스포츠과학과': '1501',

    # 의과대학
    '의학과': '1601',

    # 성균융합원
    '글로벌바이오메디컬공학과': '1701',
    '에너지학과': '1702',
    '응용AI융합학부': '1703',

    # 키워드
    '기숙사': '0001',
    '등록금': '0002',
    '수강신청': '0003',
    '공모전': '0004',
    '장학금': '0005',
    '복학': '0006',
    '성적': '0007',
    '휴학': '0008',
    '졸업': '0009',
    '봉사': '0010',
    '해외': '0011',
    '인턴': '0012',
    '계절': '0013',
}